{"comments": ["In this surprisingly adult PG movie (it's a cop show), all the animals wear clothes, predators no longer eat prey, everyone gets along and life is good. We are in a city populated by anthropomorphic animals, among which are a con-man fox and a cute bunny who is a rookie cop. Our two main characters suddenly find themselves working together as they stumble into a conspiracy that threatens the peace.Three directors (!) and ten writers -- (It always makes me nervous when it takes a committee to create a movie) -- did a good job. The plot unfolds as we admire the grit and determination of one small bunny rabbit who has always wanted to make the world a better place.Celebrity voices and the characters they represent:* Ginnifer Goodwin (\"Once Upon a Time\") is Judy Hopps, an ambitious little bunny who has always dreamed of being a cop. She aces her written tests but flunks the physical part. This only means she works harder (a GOOD lesson!); so we watch her train some more, try again, and succeed. Her life on the police force isn't what she had pictured so she isn't happy, but she IS a smart little bunny!* Idris Elba (\"Luther\") Chief Bogo wants that worthless little rabbit off his force. He sees no future for Judy and doesn't want to see her around. Even Elba's VOICE looms as he forces our frustrated little heroine to be a meter maid despite her sterling results from the academy.* Jason Bateman (\"This is Where I Leave You\") Foxy Nick Wilde is always on the lookout for a new scam. He completely fools sweet-hearted Judy when she first meets him, but she doesn't stay fooled. She isn't above a trick or two, either!* J.K. Simmons (\"Whiplash\") Mayor Lionheart is a politician... period.* Jenny Slate (Lots of TV) Bellwether is the mayor's assistant, overworked and overwhelmed. She befriends Judy at just the right time.* Octavia Spencer (\"The Help\") is Mrs. Otterton, a worried wife who can't seem to get anyone at city hall to look into the mysterious disappearance of her beloved husband...except Judy.* Raymond S Persi (\"Frozen\") I have a special spot in my heart for Flash, the sloth. Watch Judy's incredulous reaction when she realizes how much time it takes him to say a few words! There are many other talented voices who convey parental concern, bureaucratic frustration and ferocious rage, but professional voice actor Persi is a cut above.This is rated PG, so expect a scary chase scene or two and threatening animals, but no profanity or blowie uppie stuff. The artistry is wonderful; the 3D however, is unnecessary.Using motion capture and Computer Generated Imaging, the writing, acting and craftsmanship are brilliant. I'm amazed by the subtle touches in both expression and body language that inhabit today's \"cartoon\" characters. Children in the audience, both young and old, were very, very quiet as they absorbed lessons about trust, bullying, friendship, prejudice, loyalty, determination, family love, and the importance of following one's dream.Oh! And let's not forget Shakira, who was perfect, both as the spokes-gazelle for Zootopia and the vocalist who provides happy-ending dance music for the final credit scroll.", "Directed by Byron Howard (Bolt, Tangled), Rich Moore (Wreck-It Ralph) and Jared Bush (Big Hero 6) from a screenplay by Bush and Phil Johnston (Wreck-It Ralph), Zootopia is an amazing piece of work, top notch on every level from beginning to end. A lot of extremely talented people were involved in the making of this movie and it shows throughout the 108 minutes its on the screen. As entertainment that anyone of any age can enjoy, it doesn't get much better than this.The film begins in a rural small-town elementary school where a young rabbit named Judy Hopps (Della Saba) is in a presentation about what animals can aspire to when they grow up. Judy, we learn, wants to be a cop, to \"help make the world a better place.\" And nothing, it seems, is going to dissuade her from that goal. Flash forward ten years and we see Judy (now voiced by Ginnifer Goodwin) going through the police academy, overcoming all manner of challenges to eventually graduate with top marks. And off she goes, ready and eager, to the big city of Zootopia to join the ZPD (Zootopia Police Department) to make her mark in the world.Once there though, reality begins to kick in. Even though Judy was personally recruited by Mayor Lionheart (J.K. Simmons), she doesn't impress Chief Bogo (Idris Elba), a stern African buffalo who promptly assigns her to parking duty, even though the city is dealing with a flood of missing persons cases and every cop is needed. Disappointed but undaunted, Judy applies her eagerness to her assignment, ticketing parking offenders with rabbit-like speed. In the course of her day though she has three chance encounters that change everything. The first where she impulsively helps out a fox named Nick Wild (Jason Bateman) who turns out to be a shameless con-artist, the second when she impulsively abandons her parking assignment to chase down a weasel street thief named Duke Weaselton (Alan Tudyk), and the third when she overhears a distressed otter named Mrs. Otterton (Octavia Spencer) whose husband has gone missing and whom she impulsively promises to help. Yes, Judy is most definitely impulsive but she is also doggedly dedicated to making the world a better place, no matter what the odds or the obstacles in her path. There is an enormous amount of heart in Zootopia, sometimes in the strangest of places, but it pays off in a believable way and sets the film several notches above most animated features you or your kids are likely to see.The voice cast is, in a word, excellent. Ginnifer Goodwin (Once Upon A Time, Big Love) brings Judy Hopps's combination of determination, relentless enthusiasm and heart-on-her-sleeve sensitivity out wonderfully. Justin Bateman (Arrested Development, Silver Spoons) lends his sly wise-cracking smoothness to Nick Wild but also nails it when the fox's inner vulnerability comes to the fore. Idris Elba (Luther, Beasts of No Nation) is suitably gruff and no-nonsense as Judy's boss, Chief Bogo but does give the Chief his occasional comic turn as well. J.K Simmons (Whiplash, Law & Order) is appropriately pompous and grandly image-conscious as Mayor Leodore Lionheart, and Jenny Slate (Obvious Child) does a deft turn as the deceptively meek assistant mayor, sheep Dawn Bellwether. Tommy Chong is a comic delight as the laid-back and somewhat spacey yak Yax who runs a naturist club, as is Nate Torrence (Hello Ladies) who makes the chubby donut-loving cheetah Officer Benjamin Clawhauser endearingly funny and yet sympathetic as the scenes need. Veteran voice actor Maurice LaMarche (Pinky and The Brain, Futurama and a ton of other stuff) does a comic Brando/Godfather spoof as a diminutive arctic shrew crime boss ironically named Mr. Big. Alan Tudyk (Frozen, Firefly) brings the Frozen riff with his suitably shifty weasel Duke Weaselton, an obvious nod to his Duke of Weselton role in Frozen. And if the secret of comedy is timing, Raymond S. Persi (Wreck-It Ralph) is absolute perfection as the three-toed sloth Flash, Nick's friend at the Zootopia DMV, delivering his lines with a constant wait-for-it truly sloth-like cadence.The animation is marvelous in both detail and execution, particularly when it comes to the various characters' facial expressions. Judy's swings from boundless enthusiasm and determination to moments of self-doubt, Nick's innate slyness giving way to his inner vulnerability, all are beautifully rendered, giving real depth to the characters as we see them. Flash's slo-mo sloth reactions in particular are simply priceless and by themselves make Zootopia worth catching. And in addition to the way the characters are portrayed, one of the most impressive things about Zootopia is the level of thought and detail that went into the imagining of this world where animals of all sizes and traits live and work together, from the questions of what kind of housing and transportation and general habitats would be needed to how these animals would socially interact with each other. And, most notably relating to one of the themes in the movie, what kind of attitudes and prejudices they might have about each other.The musical score by Michael Giacchino (Up, Ratatouille) is beautifully done, moving from soaring to sentimental according to the needs of the scenes. But a particular delight is the movie's song \"Try Everything\" which is sung by multi-Grammy-winning pop-star Shakira, who also provides the voice for Gazelle, a Thomson's gazelle who is Zootopia's #1 pop-star in the film.. It's sure to get an Oscar nomination for Best Original Song and would be Disney's first song to do so since \"I See The Light\" from Tangled was nominated six years ago.Note: an interesting bit of trivia for anyone who might see Zootopia in different countries is that the film actually has a different animal character for the news anchor depending on the country it'll be showing in. The US, Canada, France and Finland get a moose, China gets a panda, Australia and New Zealand get a koala, Brazil a jaguar, Japan a tanuki and supposedly the UK gets a corgi. Also, some of the voice actors used are actual newscasters. The moose anchor, Peter Moosebridge, is voiced by CBC News correspondent Peter Mansbridge, while the jaguar anchor, Boi Chá, is voiced by Brazil's Jornal da Band anchor Ricardo Eugenio Boechat. Nice little touch, overall, one of many that Zootopia is filled to the brim with.Highly, highly recommended for anyone who enjoys a good imaginative story with genuine heart and memorable characters done in beautifully crafted animation.", "Like so many others I waited fingernail biting for many years. Also like many old fans I was left sorely disappointed. Now I kept my expectations relatively low for the new movie-and still it was bad! (Really bad) Most of my friends desperately wanting to keep Lucas venerated had \"it was alright/ had some cool effects\" to say, only to later join my much stronger \"I hated it\" stance. I've heard plenty of negative criticism without some specifics, so here are some of the problems with Lucas' blunder as I see them:-THE TARGET AUDIENCE: (it was kids!) Now I know the desire was to keep Star Wars available to all ages, but this failed. The original movies were mature enough in dialogue, mood, and detail to enthrall older ages, yet still accessible to younger ages (Darth is evil). This movie though, is kept accessible to its target audience while neglecting the majority of its fans.-THE COMEDY: (cheap laughs and clowning) In keeping with making a children's movie, Lucas had to ensure that all of the comedy could be understood, therefore physical buffoonery was the only out. Would it have been too much to include some subtle banter (or any verbal comedy) like that found in the other movies? (and capable of entertaining audiences older than twelve). Really though, does anything more need be said than Jar-Jar? I don't think so.-THE VIOLENCE: (can't have the kids see any) Now not that I advocate violence for its own sake, but in this film its a mix of clowning-robot breaking-safety. The first five minutes of A New Hope are more violent then this entire movie- Vader parading over the fallen bodies of the storm troopers and rebels (and this was '77, not the desensitized world of the millennium). Violence can be used as a tool to produce mood, enforce the gravity of a situation, or (as Lucas likes) a chance to have a clown dance around making light of a 'war' (I guess because we wouldn't want our target audience to become upset at all the violence)-SELF-CONTAINED WORLD: (it was not) The movie has placible accents (that are also painful) and connections with the 'real world'- i.e. the steriotypical comentators during the pod race.-THE CHARACTERS: (because I care) The characters and their interactions are boring and cardboard. The enemy is not built up at all. Sure old Mal looked pretty nifty, but what is he? The villain- he dies- oh well, whatever, nice and one sided (after all, the target audience will get it). The same emotional impact is felt when Qui-Gon dies: \"oh well\".-UNBELIEVABILITY: (suspension of disbelief has limits) Anakin is in his fighter plane, avoids dying, and accidentally shoots what turns out to be integral to the station and thereby winning the battle being 'fought' on the planet. I'm sorry I just couldn't work with it.-ANAKIN\"S FOREIGN TOUNGUE: (why? why?) Petty, maybe. Integral to the story, no. Annoying? Hell ya! Whose idea was it to have Anakin speak his rhyming gibberish? Were they going for the 'hey this sounds made up' sound, or the 'are they doing this on purpose?' sound?I apologize for not going into greater detail (because believe me, I could) but these are some of the more prominent problems to a movie that I would plan to watch again only to find all those faults that have been forgotten since seeing during its first week.My conclusion: Lucas has become drunk with success and lost his mind."]}