[{'image_url': 'http://ecx.images-amazon.com/images/I/51VE7CDD7GL.jpg', 'comments': [{'helpful': [4, 4], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'We all know the song...and surely when that song comes to mind, this Christmas classic special comes to mind. Originally aired in 1969, this has become one of the seminal "Christmas Classics" along with other Rankin/Bass fare as Rudolph, Little Drummer Boy, and Santa Claus Is Coming To Town.Unlike the others, Frosty is hand drawn animation as opposed to the studio\'s typical stop-motion animated specials.When a group of children, led by a girl named Karen, make use of a magical hat, that an inept magician (Professor Hinkle)has frustratingly thrown away..their school yard snowman becomes alive and ready to spread joy throughout the town. Awakening with his trademark "Happy Birthday", he becomes very close to Karen and her friends.Unfortunately for Frosty, Professor Hinkle has other plans and seeks to reap the benefits of this magical hat for his own ends.For 42 years, this has been among the dearest of Christmas specials and will likely remain so for years to come. As hard as many studios try to capture that Christmas audience by releasing a variety of themed holiday drek (Shrek??....really???), nothing will ever come close to Rankin/Bass and their series of specials.', 'rating': 5.0, 'sentic_emotions': ['fear', 'distraction']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "When I was in the first grade my friends from Pittsburgh sent us a mix video tape with several different christmas movies on it.  This was easily one of the best.  The movie starts at a class christmas party with a selfish magician (Professor Hinkle).  Then at the end of the day the kids build a snowman in the schoolyard.  Somehow Professor Hinkle's hat gets lose and the children find it and it brings Frosty to life.  To make a long story short, young Karen thinks it's necessary to get frosty to the north pole before he starts to melt.  So they hop a train with a refrigerated boxcar to the north pole.  The magician hops aboard and wants his hat back.Some parts are sad like when Frosty melts in the green house, Jimmy Durante does a wonderful job of narration and singing.  It gets emotional at the end when He sings &quot;Frosty the snowman had to hurry on his way, but he waved good bye saying don't you cry.  I'll be back on Christmas Day!&quot;", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction', 'trust']}, {'helpful': [3, 4], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': '**SPOILER ALERT**I\'ll bet just about everybody has seen "Frosty the Snowman" at one time or another, and I can see why it\'s a classic. The animation may not exactly be top-notch (let\'s face it, Disney\'s animation was far much better; even in those days), but that\'s not really what matters. What really matters is the music, the acting, and the story behind the animation.It\'s the day before Christmas, and a bunch of children get together to make one big snowman. After some debating, they all agree on the name "Frosty". They top their wintry creation off with an old top hat discarded by the magician Professor Hinkle, who is just about the worst magician in the world. (He can\'t even perform a simple card trick, or get a simple rabbit to come out of his hat.) The very second the hat touches Frosty\'s head, the snowman instantly comes to life. When Professor Hinkle sees that there is some magic in his hat after all, he decides he wants the hat back. The children are simply delighted to be able to talk to and play with their new friend, but when the temperature starts creeping up, Frosty realizes he must go to some place where he will never melt. And what better place to not melt than the North Pole?So, the children take Frosty downtown to the railroad station, and he and one of the children (a small girl named Karen) secretly stow away on a refrigerated box car on a train heading north. Now, a refrigerated box car really is a wonderful place to travel in--but only if one is a snowman. For Karen, who is made of human flesh, it doesn\'t take long at all for her to start shivering and sneezing with cold. Frosty knows that Karen can\'t stay in the car for much longer, so he quickly gets the both of them out the second the train comes to a rest stop.But even after they\'re out of the car, it still does not do Karen any good, for they are now out in the middle of the wilderness, where it is bitterly cold. Frosty realizes that he must get someone to help them out--someone who can get Karen home before she freezes to death, and him to the North Pole before he melts into a puddle. Hocus Pocus (Professor Hinkle\'s pet rabbit, who decides to tag along with Frosty and Karen) suggests they get Santa Claus to assist them. But Santa doesn\'t show up until nightfall, and aside from making sure that Karen is warm enough until Santa arrives, Frosty also has to worry about Professor Hinkle, who will stop at nothing to track the travelers down and reclaim possession of his hat.After temporarily giving Professor Hinkle the slip, Frosty and Karen manage to come across a small greenhouse, where a whole bunch of poinsettas (tropical Christmas flowers) are growing. Deciding that it must be very warm and comfortable inside the greenhouse, Frosty carries Karen inside. Karen protests that Frosty will melt if he goes into the greenhouse, and Frosty assures her that he\'ll only stay inside for a minute. But once they\'re inside, Professor Hinkle, who by then has caught up with them, shuts the door behind them and locks it. Now all the fiendish magician has to do is wait for Frosty to melt.Eventually Santa Claus shows up, and Hocus Pocus persuades him to help Frosty and Karen. While searching for the two of them, Santa and Hocus Pocus come across the greenhouse--the very same greenhouse in which Frosty and Karen are trapped. Santa quickly unlocks the door, but once he gets inside, a terrible sight meets his eyes: Karen is down on her knees, crying her eyes out, and all that\'s left of Frosty is an old top hat and a shapeless puddle of water on the floor. Everything looks hopeless at the moment, as you can very well imagine. Santa, however, assures Karen that all is not lost. He tells her that Frosty is not gone for good; for he is made out of Christmas snow, and Christmas snow can never disappear completely. When Karen protests that Frosty was her best friend, Santa surprises her by using his special holiday magic to restore Frosty to the way he was before.Before they can actually bring Frosty back to life with the hat, Professor Hinkle puts his foot down and demands the return of his hat then and there. Santa warns Professor Hinkle to stay away from Frosty, and to never lay so much as a finger on the brim of the hat, otherwise he\'ll permanently delete the magician from his list and never bring the magician another Christmas gift for the rest of his life. This insinuation hits Professor Hinkle hard, and he complains bitterly that it\'s not fair, for even evil magicians have to make a living. Santa then tells Professor Hinkle to go home and write "I am very sorry for what I did to Frosty" a hundred zillion times, and then maybe (just maybe) he\'ll find something in his stocking the following morning. Professor Hinkle agrees, and takes off for home as fast as he can, so that he might be able to complete the assignment before the night is over. Santa then places the hat on Frosty\'s head, and he immediately awakens, much to Karen\'s delight. Later, Santa takes Karen home, and then he takes Frosty away to the North Pole. Karen hates to say goodbye to Frosty, but Santa promises that he will bring Frosty back to the city every Christmas, and so he does. And every year from then on, Frosty\'s return is always celebrated with a big Christmas parade.I\'ve watched this movie almost every Christmas for as long as I can remember, and I don\'t think I\'ll ever get tired of watching it. It\'s really an awesome movie, one that the whole family can enjoy. If you haven\'t seen it, I recommend you do so. It\'s a real holiday treat.', 'rating': 5.0, 'sentic_emotions': ['fear', 'interest']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "&quot;Frosty the Snowman&quot; ranks up there with &quot;Rudolph&quot;. Both of them are repeatedly shown every Christmas. That's a good thing! There's alway something decent on TV at around Christmastime. The classic song is a holiady cartoon narrated by Jimmy Durante. It's something every child should see at Christmas. Merry Christmas!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Frosty the Snowman is a true Christmas classic. While my favorite Christmas special remains Rudolph the Red Nosed Reindeer,I have a special place in my heart for Frosty the Snowman and I watch it 2-3 times every December,including every Christmas Eve night. The beauty of Frosty the Snowman is that it's about imagination. How much fun is it to imagine building a snowman and having it come to life. And just around Christmas too! That's the real beauty of Frosty the Snowman. Another strong point of this show is Jimmy Durante's singing of the song Frosty the Snowman. I bought an mp3 version of Jimmy Durante's Frosty the Snowman from this show last November and it is definitely the best version of the song Frosty the Snowman that I've heard.  I highly recommend this show as it is a true Christmas classic.", 'rating': 5.0, 'sentic_emotions': ['terror', 'vigilance']}, {'helpful': [9, 11], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "This delightful 1969 animation based on the popular song is a holiday treat that many of us grew up watching, and now we can share it with our children.  By today's standards, the animation is crude, but the story is heartwarming and the narration and singing by Jimmy Durante make it a priceless treasure.We are introduced to Frosty, a snowman made by some school children with a corncob pipe, two lumps of coal and a magician's hat that brings him to life.  When the temperature starts to rise, Frosty hitches a ride on a freight train bound for the North Pole.  However, the evil Professor Hinkle is hot on his trail to try to melt Frosty and get his hat back.  Finally, Santa Claus saves the day.My son is almost three years old and he loved this video.  No doubt your child will too.", 'rating': 4.0, 'sentic_emotions': ['terror', 'amazement']}, {'helpful': [7, 8], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Frosty the Snowman:a wonderful Christmas classic!Beautifulanimation,wonderful storyline and unforgettable songs!Thisis one of the timeless Rankin-Bass classics that shouldbe in every video or DVD collection!Frosty Returns:A dud.The animation is sloppy and there is no plot.This story tries to be as good as the Rankin-Bass &quot;Frosty&quot;,but falls flat on its face.This Frosty is just a fat snowman with no personaltiy and an annoying voice.My advice is to just watch the original &quot;Frosty&quot;,and to just ignore this dull sequel.', 'rating': 3.0, 'sentic_emotions': ['terror', 'distraction']}, {'helpful': [34, 34], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Frosty the Snowman is simply superb!  It's another of author Romeo Muller's 16 animated Christmas films--all of which are splendid and marvelous.  Jimmy Durante is a most endearing narrator and singer here, and  the enchanting story of Frosty is both humorous and heart-tugging.  Watch  it, and learn why there's magic in Christmas snow! You'll also enjoy the  sequels by the same author, &quot;Frosty's Winter Wonderland,&quot;  narrated by Andy Griffith; and &quot;Rudolph and Frosty's Christmas in  July,&quot; narrated by Mickey Rooney as Santa Claus.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'interest', 'admiration']}, {'helpful': [6, 7], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'Christmas is a time of tradition, whether from food, family, or fellowship.  It is also the season when Hollywood tries to create their own traditions with the numerous "holiday specials" that clog the airways throughout the month of December.  "Frosty the Snowman" is the cream of the crop.The story is simple: A magic hat brings "Frosty" the snowman to life, after which he must travel to the North Pole to prevent being melted.  Meanwhile, an evil magician is trying to redeem the hat for his own nefarious purposes.Since 1951, children and adults alike have enjoyed this half-hour special.  Kids will be sucked in by the magic and music, while adults may just find even their eyes welling up a bit when Frosty is threatened near the end.Along with Claymation Rudolph, this TV special should be required watching around the holiday season.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'joy', 'interest', 'admiration']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love'], 'text': 'this video contains 4 cartoons. Frosty the Snowman, Christmas Visitor, Snow Foolin and Christmas in Toyland.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'interest', 'acceptance']}, {'helpful': [3, 3], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Frosty is one of my favorite Christmas cartoons and is one of the few that is still aired today at Christmastime, typically back-to-back with the dreadful and unrelated Frosty Returns. Just like other older animated specials, Frosty the Snowman has lost several minutes over the years due to commercials. The DVD version is longer, but June Foray, who voiced Karen, has been edited and dubbed by someone else for some mysterious (probably due to copyright) reason.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'amazement']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'I first heard the song Frosty the Snowman and later saw this tv special. I dont know which is better. I guess theyre both just as good. Ill find out pretty soon because I havent seen the special in years and just ordered it. However Christmas is one of the few things where Im always keeping an open mind so it no doubt will be. You should get it too. Merry Christmas', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'vigilance', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "My husband and I watched this when we were childen.  My son and daughter watched this when they where children.  Now that we are all adults, we all still love to watch Frosty the Snowman every Christmas season.  It's a classic.  They don't make them like this anymore.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [22, 25], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "No holiday film is more beloved and revered than Frosty the Snowman, other than Rudolph the Red Nosed Reindeer and the Grinch. This 1969 Masterpiece was written by the GREAT Romeo Muller, the GREATEST writer who ever lived,  the man REALLY understood children. This film has a lot for both parents  and children to enjoy. It has Jackie Vernon, giving warmth and kindness to  Frosty the Snowman, Jimmy Durante as the EXCELLENT narrator, and Billy  Dewolf as the SILLY Professor Hinkle (one of my all time favorite  characters of Christmas Mythology.) This film also includes my personal  favorite recording of ANY Christmas Song, the Jimmy Durante rendition of  the title song. (I must recomend that you purchase the spliced version on  CD.) You just can't go wrong with this film. A great one for children just  seeing it for the first time, or for parents who grew up with it  themselves. You must also buy the sequel, &quot;Frosty's Winter  Wonderland&quot; and the semi sequel &quot;Rudolph and Frosty's Christmas  in July&quot;, both buy Romeo Muller. PLEASE AVOID THE PIECE OF GARBAGE  CLAIMING TO BE A SEQUEL ENTITLED &quot;FROSTY RETURNS&quot;, ALSO ISSUED BY  GOLDEN BOOKS. IT IS A POOR PLOTLESS ATTEMPT AT A CHRISTMAS SPECIAL INDEED  AND HAS NOTHING TO DO WITH THE FROSTY THAT WE KNOW AND LOVE.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'vigilance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': "The most classical Christmas show! I remember getting excited for the holidays to watch it on tv! I still love watching it...especially now with my kids! This one has the original Frosty and Frosty Returns! Can't beat that!", 'rating': 5.0, 'sentic_emotions': ['annoyance', 'joy', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'From Rankin Bass, a cartoon classic.  The song came first but the cartoon made it a television staple.  Frosty comes to life for kids in the winter but unfortunately has to leave when it becomes warmer.  Nice simple story and warmly remembered.', 'rating': 4.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [1, 2], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Well, this does not have the captivating qualities of &quot;How the Grinch Stole Christmas&quot; or &quot;Rudolph the Red Nosed Reindeer.&quot; And unlike other Christmas specials I have rated, I can not really find any deep messages. (A lot of Christmas specials may appear for children, but they actually carry deep and profound messages.)  Nevertheless, it is a cute classic; and there are some very comical and touching moments. The most memorable moment is when Santa shows Karen that Frosty can not just melt, and I do admit I laughed when Santa told the magician he had to go home and write &quot;I'm very sorry for what I did to Frosty&quot; one hundred zillion times. I don't think this is the best Christmas special out there, but then I don't feel this should be ignored either.", 'rating': 3.0, 'sentic_emotions': ['apprehension', 'joy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': "When Frosty the Snowman (voiced by Jackie Vernon) is magically brought to life thanks to the magic of a hat that belongs to an evil magician (voiced by Billy DeWolfe) the children couldn't be happier. But when Frosty explains to him that he will melt if it gets too hot, they decide that it's up to them to help him get to the North Pole, so he won't ever melt. On their journey they meet many new friends, and adventures, but they also have to avoid the evil magician, for he has decided that he wants his magic hat back, even if he has to melt Frosty to get it.While the other Rankin / Bass holiday movies such as RUDOLPH THE RED-NOSED REINDEER and SANTA CLAUS IS COMIN' TO TOWN, are filmed with clay-type animation, FROSTY THE SNOWMAN is not. It is done simply in the form of a regular cartoon, and even so, it is still one of the most enjoyable holiday movies for children of all ages. Frosty is a kind snowman who wants to please the children more than anything. Karen (the main child chracter) loves Frosty so much, and will do anything to help him. And Hocus (the rabbit who belongs to the evil magician) is very imaginative and intelligent. As well as a hilarious addition to the cast. A must-have movie for all this holiday season.Erika Sorocco", 'rating': 5.0, 'sentic_emotions': ['anger', 'anticipation']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I purchased this in an effort to collect all classic Christmas movies. This is the original Frosty movie, the quality is definitely dated. This was the cheapest price I could find this movie for, so the value was good.', 'rating': 4.0, 'sentic_emotions': ['terror', 'ecstasy', 'interest', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'The five stars are actually for the original "Frosty the Snowman" featured on this DVD: a charmingly simple, captivating and funny Rankin Bass cartoon from around 1968 (see also theirRudolph The Red Nosed Reindeer). Unfortunately, "Frosty Returns", made some 25 years later and which also appears here, tries far too hard to be clever and switched-on with the odd "knowing" gag for the grown-ups. It succeeds only in being overly complex, cliched and completely charmless. And if you think this is the opinion of a Grinch-like grown-up, my two discerning children also preferred the original! (Also highly recommended as a pretty faithful, entertaining and child-friendly take on Dickens\' "A Christmas Carol" is the excellentMr Magoos Christmas Carol).', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'My daughter recently became obsessed withe the story of Frosty the Snowman. This version is the classic one, and is a treat.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'I have always loved Frosty now I can watch it whenever I want and will not have to wait until Christmas.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [6, 7], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'A great holiday classic DVD for the money!  This is the same Frosty the Snowman I grew up watching on TV!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'For more about Rankin/Bass and Rudolph, check out the books and blog of author/expert Rick Goldschmidt, who helped save the peppermint mine scene.Frosty the Snowman came along in 1968, when the small New York-based Rankin/Bass production company was proving itself in a marketplace dominated by Hollywood animation giants with Saturday morning series (King Kong), feature films (The Daydreamer, Mad Monster Party) and other specials (Cricket on the Hearth). Like all of their weekly series, Frosty was done in what is now called 2-D or cel animation. Almost all of their animation was done in Japan, and this was one completed at Mushi Studios.The animation isn\'t much more fluid than in their Animagic productions, but it works very well even by today\'s standards, in which flash is becoming so prevalent in TV cartoons. What makes it stand head and shoulders over most specials is its unerring simplicity, the voice cast (led by Jimmy Durante, Jackie Vernon and Billy DeWolfe) and the rich musical "house style" by Maury Laws. More than anything else, perhaps, the design by Paul Coker, Jr. comes across most dramatically in hand-drawn animation and makes Frosty look like a Christmas card come to life.Watching the crisp, linear Coker images (which resemble his work for countless greeting cards and especially MAD magazine) in Blu-ray is a treat. This was either beautifully preserved or painstakingly restored or both. By daughter remarked that it "looks like it was just made yesterday!"The "bonus" on the disc is Frosty Returns, the 1992 special CBS commissioned years later (though the 1974 Rankin/Bass \'Twas the Night Before Christmas special usually held the ratings in the second half hour following Frosty), was directed by "Peanuts" legend Bill Melendez. CBS may have also requested that the special resemble a "Peanuts" special because Frosty Returns looks almost identical to a show with Charlie Brown and Snoopy.Frosty Returns is notable for several reasons, including the voice of a very young Elisabeth Moss (Peggy Olsen on MadMen) when she was a child actor, a witty script by Oliver Goldstick and Jim Lewis, and a nice supporting cast, especially if you\'re a SCTV and Saturday Night Live fan (the executive producer was SNL\'s Lorne Michaels, whose Broadway Video controlled the Rankin/Bass video library at the time).My only quibble is that Frosty Returns either never got the loving care in the vault as it animated predecessor or there was a mastering problem, because there is a lot of "line noise" throughout, almost as if it were a VHS tape instead of a Blu-ray! I might guess that since this show is not the main attraction, it didn\'t matter as much, but you can\'t miss the flaws when you can see the images so clearly.Other than that, Frosty the Snowman itself on Blu-ray does indeed look like it was made yesterday, rather than over 40 years ago.For more about Rankin/Bass and Frosty, check out the books and blog of author/expert Rick Goldschmidt, who helped save the peppermint mine scene.NOTE: If you have the original DVD of Frosty, you may want to hang onto to it, though, because the Blu-ray contains no extras.', 'rating': 4.0, 'sentic_emotions': ['terror', 'surprise']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "I bought a Frosty dvd when our first granddaughter was 2years--she is now 4 & 1/2--we have watched it soooo many times (even in July). It is by far her favorite dvd. So when I was buying stocking stuffers this year for Christmas I bought one for her very own and she will be able to watch it anytime she wants, because she now lives in another state and can't come to Nana and Papa's every Friday night.  GREAT DVD for all ages.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Christmas classic.  Every household should have a copy.  Brings back wonderful childhood memories that are part of many holidays' past!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frustration', 'envy', 'aggressiveness', 'rivalry'], 'text': 'My kids 8, 5, and 3 had fun watching this and are now singing the Frosty the Snowman song.  This was a childhood tradition for me to watch also when I was small.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'pensiveness', 'interest', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'And so do I! It is a tender story and since my son has a frosty doll that sings the song and the book he understand the story and can sing the song (with some help) and we talk about the emotions expressed in the story.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'amazement', 'admiration']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "I love watching these old cartoons at Christmas time!  Frosty is a must-watch.  I was looking for a DVD that didn't include Frosty Returns - I had no desire to pay a cent for that political propaganda nonsense, and I don't think it ever even mentions Christmas! - so this DVD was perfect.  Highly recommend!EDIT - It does contain Frosty Returns.  Oh well!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'anticipation', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'My grandaughter was really happy with her Frosty the Snowman DVD. She has watched it every day since she received it.', 'rating': 4.0, 'sentic_emotions': ['ecstasy', 'amazement', 'trust']}, {'helpful': [0, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'This is the original production with JImmy Durante. The Jonathon winters version is Frosty returns.A good one... but its not the same nor are they both included in this purchase.', 'rating': 4.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'My kids like this movie and so do we! I just a good, classic Christmas movie! I wish it were a bit longer in length, but we still enjoy it. I am happy to be able to purchase it digitally. Now it will always be in my library and I can watch it each year without having to haul the old VHS tapes up from the basement!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Is a great transfer and a must have for Christmas lovers and blu-ray lovers.  Don't hesitate to spend the money.  It will be something treasured for years to come.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [0, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'Our two grand daughters, ages 3 and 2, absolutely adore this video.  They\'ll even sing the Frosty song in the car.  The 2 year old , last month, during her bedtime prayers, even asked God to "please help Frosty with his melting."  I think part of the reason is that it\'s not too long for their attention span.  Plus they love the characters, the animation and Jimmy Durante\'s narration.  What a voice!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'anticipation', 'trust']}, {'helpful': [1, 2], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': "Both movies have their place.  Most reviews slam Frosty Returns for poor values and examples yet fail to mention that the original encourages bad behaviors as well such as stealing the hat and stowing away on a train when they didn't have the money to pay for the ticket.  The original is definately cuter, but shorter.", 'rating': 3.0, 'sentic_emotions': ['rage', 'distraction']}, {'helpful': [5, 7], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "A fabulous Christmas-time or anytime video for kids and adults. Sweet story of friendship, sacrifice, loss and fighting for what's right... all thrown in with a pinch of magic in that old top hat they found. Great  songs, great animation, great family fun... what else can you say? If  you've got kids or if you used to be one, you need this video.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'amazement', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'This is an old standard for Christmas or any other time for young children. My kids saw this over 31 years ago and now have their own copy for their children. I enjoy quality and this is one of the best!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'anticipation', 'trust']}, {'helpful': [0, 3], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I remembered this as a holiday classic from the days of broadcast. It is not.  The story is lame and the animation is weak.  My kids wanted to enjoy it but clearly will not on second viewing.', 'rating': 2.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'anticipation', 'admiration']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'Our 3 year old is in love with Frosty and anything winter so this is a blessing to have access to all the time.', 'rating': 4.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism'], 'text': "Every child should have a version of this movie, it's as timeless as Frosty himself. There is no one like Jimmy Duranty", 'rating': 5.0, 'sentic_emotions': ['serenity', 'interest']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'Downloaded this to our kindle fire and our 2 year old LOVES it! We were so happy to be able to share one of the classics we grew up with at Christmas time. Would definitely recommend to anyone looking for a fun Christmas movie.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'enjoyable little story with a happy ending, and funny characters. good childhood memories before on demand was around. still a must for the christmas season', 'rating': 4.0, 'sentic_emotions': ['terror']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love'], 'text': 'It is a great video for the kids, parents and grandparents to enjoy at Christmas time:) Hope your family enjoys it as much as our family does.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'vigilance', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'Have always loved the old movies and this is the original frosty the snowman like I remember from my child hood. Grandkids loved watching it', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'This is an oldie that brings back happy younger days. I chose this one because I only have a VHS tape and I wanted my grandchildren to share the Christmas fun.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'Such a great classic Christmas movie, it is nice to pass it on to another generation. I watch it over and over!', 'rating': 5.0, 'sentic_emotions': ['rage', 'interest', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'I wanted the old time christmas movie to be able to share it with my grandchildren. It was perfect we watched it together christmas eve. I hope to make it a tradition.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Super classic! If you havn't seen this classic you have yet to live.  Can't imagine Christmas without it. Instantly loved by any child who watches it.", 'rating': 5.0, 'sentic_emotions': ['fear', 'ecstasy', 'distraction', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'One of my favorite Christmas specials ever!  Thank you! A classic movie that everyone should own.  Great quality.  Thank you!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'This is a classic movie that I have introduced my children to. Its a heartwarming story that is perfect for the holiday season.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'Ordered as a Christmas gift for granddaughters.  The shipment was fast and it arrived in excellent time, was enjoyed immensely and brought back a lot of memories!', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': "After all these years it's still a classic!  My five year old loved it as much as I did when I was a kid.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'My husband grew up with this movie and was super excited to get it for Christmas! We now own the whole collection!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'My 2 year old daughter fell in love with Frosty the first time she saw it.  She was asking to watch it one night and the DVR had deleted it so I quick ordered it from Amazon and we were in business in less than 2 minutes.', 'rating': 5.0, 'sentic_emotions': ['terror', 'interest']}, {'helpful': [0, 2], 'relevancy': 0.0, 'compound_emotions': ['frustration', 'envy', 'anxiety', 'submission'], 'text': 'SO not worth the $9.99 to watch this very short, classic video.  We wanted to share in this with our 3 year old daughter, but the price is outrageous.', 'rating': 2.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I loved this as a kid and both my kids (4 and 2) loved it. Very fun and a nice story.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'This is a classic that every child should see during the holidays in my opinion. He watched it many times after opening it!', 'rating': 5.0, 'sentic_emotions': ['fear', 'ecstasy', 'distraction', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I replaced a worn out VCR tape with this. Beautiful. My adult kids wanted it here (memories of childhood) The quality is excellent.', 'rating': 5.0, 'sentic_emotions': ['fear', 'interest']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Very classic movie that brings back a load of memories from my childhood.I got this one to give to my little grandson. He enjoys it.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'amazement', 'admiration']}], 'emotions': ['angry', 'mad', 'rage'], 'product_name': 'test title one'}, {'image_url': 'http://ecx.images-amazon.com/images/I/51VE7CDD7GL.jpg', 'comments': [{'helpful': [4, 4], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'We all know the song...and surely when that song comes to mind, this Christmas classic special comes to mind. Originally aired in 1969, this has become one of the seminal "Christmas Classics" along with other Rankin/Bass fare as Rudolph, Little Drummer Boy, and Santa Claus Is Coming To Town.Unlike the others, Frosty is hand drawn animation as opposed to the studio\'s typical stop-motion animated specials.When a group of children, led by a girl named Karen, make use of a magical hat, that an inept magician (Professor Hinkle)has frustratingly thrown away..their school yard snowman becomes alive and ready to spread joy throughout the town. Awakening with his trademark "Happy Birthday", he becomes very close to Karen and her friends.Unfortunately for Frosty, Professor Hinkle has other plans and seeks to reap the benefits of this magical hat for his own ends.For 42 years, this has been among the dearest of Christmas specials and will likely remain so for years to come. As hard as many studios try to capture that Christmas audience by releasing a variety of themed holiday drek (Shrek??....really???), nothing will ever come close to Rankin/Bass and their series of specials.', 'rating': 5.0, 'sentic_emotions': ['fear', 'distraction']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "When I was in the first grade my friends from Pittsburgh sent us a mix video tape with several different christmas movies on it.  This was easily one of the best.  The movie starts at a class christmas party with a selfish magician (Professor Hinkle).  Then at the end of the day the kids build a snowman in the schoolyard.  Somehow Professor Hinkle's hat gets lose and the children find it and it brings Frosty to life.  To make a long story short, young Karen thinks it's necessary to get frosty to the north pole before he starts to melt.  So they hop a train with a refrigerated boxcar to the north pole.  The magician hops aboard and wants his hat back.Some parts are sad like when Frosty melts in the green house, Jimmy Durante does a wonderful job of narration and singing.  It gets emotional at the end when He sings &quot;Frosty the snowman had to hurry on his way, but he waved good bye saying don't you cry.  I'll be back on Christmas Day!&quot;", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction', 'trust']}, {'helpful': [3, 4], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': '**SPOILER ALERT**I\'ll bet just about everybody has seen "Frosty the Snowman" at one time or another, and I can see why it\'s a classic. The animation may not exactly be top-notch (let\'s face it, Disney\'s animation was far much better; even in those days), but that\'s not really what matters. What really matters is the music, the acting, and the story behind the animation.It\'s the day before Christmas, and a bunch of children get together to make one big snowman. After some debating, they all agree on the name "Frosty". They top their wintry creation off with an old top hat discarded by the magician Professor Hinkle, who is just about the worst magician in the world. (He can\'t even perform a simple card trick, or get a simple rabbit to come out of his hat.) The very second the hat touches Frosty\'s head, the snowman instantly comes to life. When Professor Hinkle sees that there is some magic in his hat after all, he decides he wants the hat back. The children are simply delighted to be able to talk to and play with their new friend, but when the temperature starts creeping up, Frosty realizes he must go to some place where he will never melt. And what better place to not melt than the North Pole?So, the children take Frosty downtown to the railroad station, and he and one of the children (a small girl named Karen) secretly stow away on a refrigerated box car on a train heading north. Now, a refrigerated box car really is a wonderful place to travel in--but only if one is a snowman. For Karen, who is made of human flesh, it doesn\'t take long at all for her to start shivering and sneezing with cold. Frosty knows that Karen can\'t stay in the car for much longer, so he quickly gets the both of them out the second the train comes to a rest stop.But even after they\'re out of the car, it still does not do Karen any good, for they are now out in the middle of the wilderness, where it is bitterly cold. Frosty realizes that he must get someone to help them out--someone who can get Karen home before she freezes to death, and him to the North Pole before he melts into a puddle. Hocus Pocus (Professor Hinkle\'s pet rabbit, who decides to tag along with Frosty and Karen) suggests they get Santa Claus to assist them. But Santa doesn\'t show up until nightfall, and aside from making sure that Karen is warm enough until Santa arrives, Frosty also has to worry about Professor Hinkle, who will stop at nothing to track the travelers down and reclaim possession of his hat.After temporarily giving Professor Hinkle the slip, Frosty and Karen manage to come across a small greenhouse, where a whole bunch of poinsettas (tropical Christmas flowers) are growing. Deciding that it must be very warm and comfortable inside the greenhouse, Frosty carries Karen inside. Karen protests that Frosty will melt if he goes into the greenhouse, and Frosty assures her that he\'ll only stay inside for a minute. But once they\'re inside, Professor Hinkle, who by then has caught up with them, shuts the door behind them and locks it. Now all the fiendish magician has to do is wait for Frosty to melt.Eventually Santa Claus shows up, and Hocus Pocus persuades him to help Frosty and Karen. While searching for the two of them, Santa and Hocus Pocus come across the greenhouse--the very same greenhouse in which Frosty and Karen are trapped. Santa quickly unlocks the door, but once he gets inside, a terrible sight meets his eyes: Karen is down on her knees, crying her eyes out, and all that\'s left of Frosty is an old top hat and a shapeless puddle of water on the floor. Everything looks hopeless at the moment, as you can very well imagine. Santa, however, assures Karen that all is not lost. He tells her that Frosty is not gone for good; for he is made out of Christmas snow, and Christmas snow can never disappear completely. When Karen protests that Frosty was her best friend, Santa surprises her by using his special holiday magic to restore Frosty to the way he was before.Before they can actually bring Frosty back to life with the hat, Professor Hinkle puts his foot down and demands the return of his hat then and there. Santa warns Professor Hinkle to stay away from Frosty, and to never lay so much as a finger on the brim of the hat, otherwise he\'ll permanently delete the magician from his list and never bring the magician another Christmas gift for the rest of his life. This insinuation hits Professor Hinkle hard, and he complains bitterly that it\'s not fair, for even evil magicians have to make a living. Santa then tells Professor Hinkle to go home and write "I am very sorry for what I did to Frosty" a hundred zillion times, and then maybe (just maybe) he\'ll find something in his stocking the following morning. Professor Hinkle agrees, and takes off for home as fast as he can, so that he might be able to complete the assignment before the night is over. Santa then places the hat on Frosty\'s head, and he immediately awakens, much to Karen\'s delight. Later, Santa takes Karen home, and then he takes Frosty away to the North Pole. Karen hates to say goodbye to Frosty, but Santa promises that he will bring Frosty back to the city every Christmas, and so he does. And every year from then on, Frosty\'s return is always celebrated with a big Christmas parade.I\'ve watched this movie almost every Christmas for as long as I can remember, and I don\'t think I\'ll ever get tired of watching it. It\'s really an awesome movie, one that the whole family can enjoy. If you haven\'t seen it, I recommend you do so. It\'s a real holiday treat.', 'rating': 5.0, 'sentic_emotions': ['fear', 'interest']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "&quot;Frosty the Snowman&quot; ranks up there with &quot;Rudolph&quot;. Both of them are repeatedly shown every Christmas. That's a good thing! There's alway something decent on TV at around Christmastime. The classic song is a holiady cartoon narrated by Jimmy Durante. It's something every child should see at Christmas. Merry Christmas!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Frosty the Snowman is a true Christmas classic. While my favorite Christmas special remains Rudolph the Red Nosed Reindeer,I have a special place in my heart for Frosty the Snowman and I watch it 2-3 times every December,including every Christmas Eve night. The beauty of Frosty the Snowman is that it's about imagination. How much fun is it to imagine building a snowman and having it come to life. And just around Christmas too! That's the real beauty of Frosty the Snowman. Another strong point of this show is Jimmy Durante's singing of the song Frosty the Snowman. I bought an mp3 version of Jimmy Durante's Frosty the Snowman from this show last November and it is definitely the best version of the song Frosty the Snowman that I've heard.  I highly recommend this show as it is a true Christmas classic.", 'rating': 5.0, 'sentic_emotions': ['terror', 'vigilance']}, {'helpful': [9, 11], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "This delightful 1969 animation based on the popular song is a holiday treat that many of us grew up watching, and now we can share it with our children.  By today's standards, the animation is crude, but the story is heartwarming and the narration and singing by Jimmy Durante make it a priceless treasure.We are introduced to Frosty, a snowman made by some school children with a corncob pipe, two lumps of coal and a magician's hat that brings him to life.  When the temperature starts to rise, Frosty hitches a ride on a freight train bound for the North Pole.  However, the evil Professor Hinkle is hot on his trail to try to melt Frosty and get his hat back.  Finally, Santa Claus saves the day.My son is almost three years old and he loved this video.  No doubt your child will too.", 'rating': 4.0, 'sentic_emotions': ['terror', 'amazement']}, {'helpful': [7, 8], 'relevancy': 1.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Frosty the Snowman:a wonderful Christmas classic!Beautifulanimation,wonderful storyline and unforgettable songs!Thisis one of the timeless Rankin-Bass classics that shouldbe in every video or DVD collection!Frosty Returns:A dud.The animation is sloppy and there is no plot.This story tries to be as good as the Rankin-Bass &quot;Frosty&quot;,but falls flat on its face.This Frosty is just a fat snowman with no personaltiy and an annoying voice.My advice is to just watch the original &quot;Frosty&quot;,and to just ignore this dull sequel.', 'rating': 3.0, 'sentic_emotions': ['terror', 'distraction']}, {'helpful': [34, 34], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Frosty the Snowman is simply superb!  It's another of author Romeo Muller's 16 animated Christmas films--all of which are splendid and marvelous.  Jimmy Durante is a most endearing narrator and singer here, and  the enchanting story of Frosty is both humorous and heart-tugging.  Watch  it, and learn why there's magic in Christmas snow! You'll also enjoy the  sequels by the same author, &quot;Frosty's Winter Wonderland,&quot;  narrated by Andy Griffith; and &quot;Rudolph and Frosty's Christmas in  July,&quot; narrated by Mickey Rooney as Santa Claus.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'interest', 'admiration']}, {'helpful': [6, 7], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'Christmas is a time of tradition, whether from food, family, or fellowship.  It is also the season when Hollywood tries to create their own traditions with the numerous "holiday specials" that clog the airways throughout the month of December.  "Frosty the Snowman" is the cream of the crop.The story is simple: A magic hat brings "Frosty" the snowman to life, after which he must travel to the North Pole to prevent being melted.  Meanwhile, an evil magician is trying to redeem the hat for his own nefarious purposes.Since 1951, children and adults alike have enjoyed this half-hour special.  Kids will be sucked in by the magic and music, while adults may just find even their eyes welling up a bit when Frosty is threatened near the end.Along with Claymation Rudolph, this TV special should be required watching around the holiday season.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'joy', 'interest', 'admiration']}, {'helpful': [0, 0], 'relevancy': 1.0, 'compound_emotions': ['optimism', 'love'], 'text': 'this video contains 4 cartoons. Frosty the Snowman, Christmas Visitor, Snow Foolin and Christmas in Toyland.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'interest', 'acceptance']}, {'helpful': [3, 3], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Frosty is one of my favorite Christmas cartoons and is one of the few that is still aired today at Christmastime, typically back-to-back with the dreadful and unrelated Frosty Returns. Just like other older animated specials, Frosty the Snowman has lost several minutes over the years due to commercials. The DVD version is longer, but June Foray, who voiced Karen, has been edited and dubbed by someone else for some mysterious (probably due to copyright) reason.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'amazement']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'I first heard the song Frosty the Snowman and later saw this tv special. I dont know which is better. I guess theyre both just as good. Ill find out pretty soon because I havent seen the special in years and just ordered it. However Christmas is one of the few things where Im always keeping an open mind so it no doubt will be. You should get it too. Merry Christmas', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'vigilance', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "My husband and I watched this when we were childen.  My son and daughter watched this when they where children.  Now that we are all adults, we all still love to watch Frosty the Snowman every Christmas season.  It's a classic.  They don't make them like this anymore.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [22, 25], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "No holiday film is more beloved and revered than Frosty the Snowman, other than Rudolph the Red Nosed Reindeer and the Grinch. This 1969 Masterpiece was written by the GREAT Romeo Muller, the GREATEST writer who ever lived,  the man REALLY understood children. This film has a lot for both parents  and children to enjoy. It has Jackie Vernon, giving warmth and kindness to  Frosty the Snowman, Jimmy Durante as the EXCELLENT narrator, and Billy  Dewolf as the SILLY Professor Hinkle (one of my all time favorite  characters of Christmas Mythology.) This film also includes my personal  favorite recording of ANY Christmas Song, the Jimmy Durante rendition of  the title song. (I must recomend that you purchase the spliced version on  CD.) You just can't go wrong with this film. A great one for children just  seeing it for the first time, or for parents who grew up with it  themselves. You must also buy the sequel, &quot;Frosty's Winter  Wonderland&quot; and the semi sequel &quot;Rudolph and Frosty's Christmas  in July&quot;, both buy Romeo Muller. PLEASE AVOID THE PIECE OF GARBAGE  CLAIMING TO BE A SEQUEL ENTITLED &quot;FROSTY RETURNS&quot;, ALSO ISSUED BY  GOLDEN BOOKS. IT IS A POOR PLOTLESS ATTEMPT AT A CHRISTMAS SPECIAL INDEED  AND HAS NOTHING TO DO WITH THE FROSTY THAT WE KNOW AND LOVE.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'vigilance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': "The most classical Christmas show! I remember getting excited for the holidays to watch it on tv! I still love watching it...especially now with my kids! This one has the original Frosty and Frosty Returns! Can't beat that!", 'rating': 5.0, 'sentic_emotions': ['annoyance', 'joy', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'From Rankin Bass, a cartoon classic.  The song came first but the cartoon made it a television staple.  Frosty comes to life for kids in the winter but unfortunately has to leave when it becomes warmer.  Nice simple story and warmly remembered.', 'rating': 4.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [1, 2], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Well, this does not have the captivating qualities of &quot;How the Grinch Stole Christmas&quot; or &quot;Rudolph the Red Nosed Reindeer.&quot; And unlike other Christmas specials I have rated, I can not really find any deep messages. (A lot of Christmas specials may appear for children, but they actually carry deep and profound messages.)  Nevertheless, it is a cute classic; and there are some very comical and touching moments. The most memorable moment is when Santa shows Karen that Frosty can not just melt, and I do admit I laughed when Santa told the magician he had to go home and write &quot;I'm very sorry for what I did to Frosty&quot; one hundred zillion times. I don't think this is the best Christmas special out there, but then I don't feel this should be ignored either.", 'rating': 3.0, 'sentic_emotions': ['apprehension', 'joy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': "When Frosty the Snowman (voiced by Jackie Vernon) is magically brought to life thanks to the magic of a hat that belongs to an evil magician (voiced by Billy DeWolfe) the children couldn't be happier. But when Frosty explains to him that he will melt if it gets too hot, they decide that it's up to them to help him get to the North Pole, so he won't ever melt. On their journey they meet many new friends, and adventures, but they also have to avoid the evil magician, for he has decided that he wants his magic hat back, even if he has to melt Frosty to get it.While the other Rankin / Bass holiday movies such as RUDOLPH THE RED-NOSED REINDEER and SANTA CLAUS IS COMIN' TO TOWN, are filmed with clay-type animation, FROSTY THE SNOWMAN is not. It is done simply in the form of a regular cartoon, and even so, it is still one of the most enjoyable holiday movies for children of all ages. Frosty is a kind snowman who wants to please the children more than anything. Karen (the main child chracter) loves Frosty so much, and will do anything to help him. And Hocus (the rabbit who belongs to the evil magician) is very imaginative and intelligent. As well as a hilarious addition to the cast. A must-have movie for all this holiday season.Erika Sorocco", 'rating': 5.0, 'sentic_emotions': ['anger', 'anticipation']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I purchased this in an effort to collect all classic Christmas movies. This is the original Frosty movie, the quality is definitely dated. This was the cheapest price I could find this movie for, so the value was good.', 'rating': 4.0, 'sentic_emotions': ['terror', 'ecstasy', 'interest', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'The five stars are actually for the original "Frosty the Snowman" featured on this DVD: a charmingly simple, captivating and funny Rankin Bass cartoon from around 1968 (see also theirRudolph The Red Nosed Reindeer). Unfortunately, "Frosty Returns", made some 25 years later and which also appears here, tries far too hard to be clever and switched-on with the odd "knowing" gag for the grown-ups. It succeeds only in being overly complex, cliched and completely charmless. And if you think this is the opinion of a Grinch-like grown-up, my two discerning children also preferred the original! (Also highly recommended as a pretty faithful, entertaining and child-friendly take on Dickens\' "A Christmas Carol" is the excellentMr Magoos Christmas Carol).', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'My daughter recently became obsessed withe the story of Frosty the Snowman. This version is the classic one, and is a treat.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'I have always loved Frosty now I can watch it whenever I want and will not have to wait until Christmas.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [6, 7], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'A great holiday classic DVD for the money!  This is the same Frosty the Snowman I grew up watching on TV!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'For more about Rankin/Bass and Rudolph, check out the books and blog of author/expert Rick Goldschmidt, who helped save the peppermint mine scene.Frosty the Snowman came along in 1968, when the small New York-based Rankin/Bass production company was proving itself in a marketplace dominated by Hollywood animation giants with Saturday morning series (King Kong), feature films (The Daydreamer, Mad Monster Party) and other specials (Cricket on the Hearth). Like all of their weekly series, Frosty was done in what is now called 2-D or cel animation. Almost all of their animation was done in Japan, and this was one completed at Mushi Studios.The animation isn\'t much more fluid than in their Animagic productions, but it works very well even by today\'s standards, in which flash is becoming so prevalent in TV cartoons. What makes it stand head and shoulders over most specials is its unerring simplicity, the voice cast (led by Jimmy Durante, Jackie Vernon and Billy DeWolfe) and the rich musical "house style" by Maury Laws. More than anything else, perhaps, the design by Paul Coker, Jr. comes across most dramatically in hand-drawn animation and makes Frosty look like a Christmas card come to life.Watching the crisp, linear Coker images (which resemble his work for countless greeting cards and especially MAD magazine) in Blu-ray is a treat. This was either beautifully preserved or painstakingly restored or both. By daughter remarked that it "looks like it was just made yesterday!"The "bonus" on the disc is Frosty Returns, the 1992 special CBS commissioned years later (though the 1974 Rankin/Bass \'Twas the Night Before Christmas special usually held the ratings in the second half hour following Frosty), was directed by "Peanuts" legend Bill Melendez. CBS may have also requested that the special resemble a "Peanuts" special because Frosty Returns looks almost identical to a show with Charlie Brown and Snoopy.Frosty Returns is notable for several reasons, including the voice of a very young Elisabeth Moss (Peggy Olsen on MadMen) when she was a child actor, a witty script by Oliver Goldstick and Jim Lewis, and a nice supporting cast, especially if you\'re a SCTV and Saturday Night Live fan (the executive producer was SNL\'s Lorne Michaels, whose Broadway Video controlled the Rankin/Bass video library at the time).My only quibble is that Frosty Returns either never got the loving care in the vault as it animated predecessor or there was a mastering problem, because there is a lot of "line noise" throughout, almost as if it were a VHS tape instead of a Blu-ray! I might guess that since this show is not the main attraction, it didn\'t matter as much, but you can\'t miss the flaws when you can see the images so clearly.Other than that, Frosty the Snowman itself on Blu-ray does indeed look like it was made yesterday, rather than over 40 years ago.For more about Rankin/Bass and Frosty, check out the books and blog of author/expert Rick Goldschmidt, who helped save the peppermint mine scene.NOTE: If you have the original DVD of Frosty, you may want to hang onto to it, though, because the Blu-ray contains no extras.', 'rating': 4.0, 'sentic_emotions': ['terror', 'surprise']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "I bought a Frosty dvd when our first granddaughter was 2years--she is now 4 & 1/2--we have watched it soooo many times (even in July). It is by far her favorite dvd. So when I was buying stocking stuffers this year for Christmas I bought one for her very own and she will be able to watch it anytime she wants, because she now lives in another state and can't come to Nana and Papa's every Friday night.  GREAT DVD for all ages.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Christmas classic.  Every household should have a copy.  Brings back wonderful childhood memories that are part of many holidays' past!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'surprise', 'trust']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frustration', 'envy', 'aggressiveness', 'rivalry'], 'text': 'My kids 8, 5, and 3 had fun watching this and are now singing the Frosty the Snowman song.  This was a childhood tradition for me to watch also when I was small.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'pensiveness', 'interest', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'And so do I! It is a tender story and since my son has a frosty doll that sings the song and the book he understand the story and can sing the song (with some help) and we talk about the emotions expressed in the story.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'amazement', 'admiration']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "I love watching these old cartoons at Christmas time!  Frosty is a must-watch.  I was looking for a DVD that didn't include Frosty Returns - I had no desire to pay a cent for that political propaganda nonsense, and I don't think it ever even mentions Christmas! - so this DVD was perfect.  Highly recommend!EDIT - It does contain Frosty Returns.  Oh well!", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'anticipation', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'My grandaughter was really happy with her Frosty the Snowman DVD. She has watched it every day since she received it.', 'rating': 4.0, 'sentic_emotions': ['ecstasy', 'amazement', 'trust']}, {'helpful': [0, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'This is the original production with JImmy Durante. The Jonathon winters version is Frosty returns.A good one... but its not the same nor are they both included in this purchase.', 'rating': 4.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'My kids like this movie and so do we! I just a good, classic Christmas movie! I wish it were a bit longer in length, but we still enjoy it. I am happy to be able to purchase it digitally. Now it will always be in my library and I can watch it each year without having to haul the old VHS tapes up from the basement!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'distraction', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': "Is a great transfer and a must have for Christmas lovers and blu-ray lovers.  Don't hesitate to spend the money.  It will be something treasured for years to come.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [0, 1], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'Our two grand daughters, ages 3 and 2, absolutely adore this video.  They\'ll even sing the Frosty song in the car.  The 2 year old , last month, during her bedtime prayers, even asked God to "please help Frosty with his melting."  I think part of the reason is that it\'s not too long for their attention span.  Plus they love the characters, the animation and Jimmy Durante\'s narration.  What a voice!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'anticipation', 'trust']}, {'helpful': [1, 2], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': "Both movies have their place.  Most reviews slam Frosty Returns for poor values and examples yet fail to mention that the original encourages bad behaviors as well such as stealing the hat and stowing away on a train when they didn't have the money to pay for the ticket.  The original is definately cuter, but shorter.", 'rating': 3.0, 'sentic_emotions': ['rage', 'distraction']}, {'helpful': [5, 7], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "A fabulous Christmas-time or anytime video for kids and adults. Sweet story of friendship, sacrifice, loss and fighting for what's right... all thrown in with a pinch of magic in that old top hat they found. Great  songs, great animation, great family fun... what else can you say? If  you've got kids or if you used to be one, you need this video.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'amazement', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'This is an old standard for Christmas or any other time for young children. My kids saw this over 31 years ago and now have their own copy for their children. I enjoy quality and this is one of the best!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'anticipation', 'trust']}, {'helpful': [0, 3], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I remembered this as a holiday classic from the days of broadcast. It is not.  The story is lame and the animation is weak.  My kids wanted to enjoy it but clearly will not on second viewing.', 'rating': 2.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'anticipation', 'admiration']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'Our 3 year old is in love with Frosty and anything winter so this is a blessing to have access to all the time.', 'rating': 4.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism'], 'text': "Every child should have a version of this movie, it's as timeless as Frosty himself. There is no one like Jimmy Duranty", 'rating': 5.0, 'sentic_emotions': ['serenity', 'interest']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'Downloaded this to our kindle fire and our 2 year old LOVES it! We were so happy to be able to share one of the classics we grew up with at Christmas time. Would definitely recommend to anyone looking for a fun Christmas movie.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'enjoyable little story with a happy ending, and funny characters. good childhood memories before on demand was around. still a must for the christmas season', 'rating': 4.0, 'sentic_emotions': ['terror']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love'], 'text': 'It is a great video for the kids, parents and grandparents to enjoy at Christmas time:) Hope your family enjoys it as much as our family does.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'vigilance', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'Have always loved the old movies and this is the original frosty the snowman like I remember from my child hood. Grandkids loved watching it', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'This is an oldie that brings back happy younger days. I chose this one because I only have a VHS tape and I wanted my grandchildren to share the Christmas fun.', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'aggressiveness', 'rivalry'], 'text': 'Such a great classic Christmas movie, it is nice to pass it on to another generation. I watch it over and over!', 'rating': 5.0, 'sentic_emotions': ['rage', 'interest', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'rejection', 'rivalry'], 'text': 'I wanted the old time christmas movie to be able to share it with my grandchildren. It was perfect we watched it together christmas eve. I hope to make it a tradition.', 'rating': 5.0, 'sentic_emotions': ['annoyance', 'ecstasy', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': "Super classic! If you havn't seen this classic you have yet to live.  Can't imagine Christmas without it. Instantly loved by any child who watches it.", 'rating': 5.0, 'sentic_emotions': ['fear', 'ecstasy', 'distraction', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'One of my favorite Christmas specials ever!  Thank you! A classic movie that everyone should own.  Great quality.  Thank you!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'interest', 'acceptance']}, {'helpful': [1, 1], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': 'This is a classic movie that I have introduced my children to. Its a heartwarming story that is perfect for the holiday season.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love'], 'text': 'Ordered as a Christmas gift for granddaughters.  The shipment was fast and it arrived in excellent time, was enjoyed immensely and brought back a lot of memories!', 'rating': 5.0, 'sentic_emotions': ['ecstasy', 'surprise', 'admiration']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['disapproval', 'envy', 'awe', 'submission'], 'text': "After all these years it's still a classic!  My five year old loved it as much as I did when I was a kid.", 'rating': 5.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'surprise', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'My husband grew up with this movie and was super excited to get it for Christmas! We now own the whole collection!', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'joy', 'distraction', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'My 2 year old daughter fell in love with Frosty the first time she saw it.  She was asking to watch it one night and the DVR had deleted it so I quick ordered it from Amazon and we were in business in less than 2 minutes.', 'rating': 5.0, 'sentic_emotions': ['terror', 'interest']}, {'helpful': [0, 2], 'relevancy': 0.0, 'compound_emotions': ['frustration', 'envy', 'anxiety', 'submission'], 'text': 'SO not worth the $9.99 to watch this very short, classic video.  We wanted to share in this with our 3 year old daughter, but the price is outrageous.', 'rating': 2.0, 'sentic_emotions': ['apprehension', 'pensiveness', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I loved this as a kid and both my kids (4 and 2) loved it. Very fun and a nice story.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'serenity', 'interest', 'acceptance']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'This is a classic that every child should see during the holidays in my opinion. He watched it many times after opening it!', 'rating': 5.0, 'sentic_emotions': ['fear', 'ecstasy', 'distraction', 'trust']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['optimism', 'love', 'anxiety', 'submission'], 'text': 'I replaced a worn out VCR tape with this. Beautiful. My adult kids wanted it here (memories of childhood) The quality is excellent.', 'rating': 5.0, 'sentic_emotions': ['fear', 'interest']}, {'helpful': [0, 0], 'relevancy': 0.0, 'compound_emotions': ['frivolity', 'love', 'awe', 'submission'], 'text': 'Very classic movie that brings back a load of memories from my childhood.I got this one to give to my little grandson. He enjoys it.', 'rating': 5.0, 'sentic_emotions': ['apprehension', 'ecstasy', 'amazement', 'admiration']}], 'emotions': ['happy', 'love', 'sad'], 'product_name': 'test title two'}]
